multi-agent-docker/tests/load-tests/api-load-test.yml
config:
  target: "http://localhost:9090"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  processor: "./processor.js"
  variables:
    api_key: "change-this-secret-key"

scenarios:
  - name: "Health check load"
    weight: 30
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Metrics scraping"
    weight: 20
    flow:
      - get:
          url: "/metrics"
          expect:
            - statusCode: 200
            - contentType: "text/plain"

  - name: "Authenticated API calls"
    weight: 40
    flow:
      - get:
          url: "/v1/status"
          headers:
            X-API-Key: "{{ api_key }}"
          expect:
            - statusCode: 200

  - name: "Documentation access"
    weight: 10
    flow:
      - get:
          url: "/docs/json"
          expect:
            - statusCode: 200
            - contentType: "application/json"